Revit 2027 API
WaterLoopType Enumeration
 The type of water loop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum WaterLoopType
Public Enumeration WaterLoopType
public enum class WaterLoopType
type WaterLoopType
Members
Member name | Value | Description
ChilledWater | 1
CondenserWater | 2
HotWater | 3
Undefined | 0
VRF | 4
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace